Revit 2027 API
CoordinationModelLinkUtils.ReloadLocalCoordinationModelFrom Method
 Reloads a local Coordination Model type from the specified absolute path of a .nwc or .nwd file.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ReloadLocalCoordinationModelFrom(
	Document document,
	ElementType coordinationModelType,
	string filePath
)
Public Shared Sub ReloadLocalCoordinationModelFrom (
	document As Document,
	coordinationModelType As ElementType,
	filePath As String
)
public:
static void ReloadLocalCoordinationModelFrom(
	Document^ document,
	ElementType^ coordinationModelType,
	String^ filePath
)
static member ReloadLocalCoordinationModelFrom :
        document : Document *
        coordinationModelType : ElementType *
        filePath : string -> unit
Parameters
document Document
 The document.
coordinationModelType ElementType
 The Coordination Model type element to reload.
filePath String
 The file's absolute or relative path to reload from.
Exceptions
Exception | Condition
ArgumentException |  Failed to validate file type. -or- document is not a project document. -or- The provided element is not a local Coordination Model type.
ArgumentNullException |  A non-optional argument was null
FileArgumentNotFoundException |  The given filePath does not exist.
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- Failed to reload Coordination Model type from specified path.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 In case the file path is not an absolute path, it is considered to be relative to the Revit document's saved path.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace